nce3-2/L33.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-25 Mon 22:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orge52f448" class="outline-2">
<h2 id="orge52f448">Lesson 33 A day to remember</h2>
<div class="outline-text-2" id="text-orge52f448">
<p class="verse">
What incident began the series of traffic accidents?<br />
<br />
We have all experienced days when everything goes wrong.<br />
A day may begin well enough, but suddenly everything seems to <b>get out of control</b>.<br />
<b>What invariably happens is</b><br />
&#xa0;that a great number of things choose to go wrong at precisely the same moment.<br />
It is as if a single unimportant event <b>set up a chain of reactions</b>.<br />
Let us suppose that you are preparing a meal and <b>keeping an eye on</b> the bay at the same time.<br />
The telephone rings and this marks <b>the prelude to an unforseen series of</b> catastrophes.<br />
While you <b>are on the phone</b>, the baby pulls the tablecloth off the table,<br />
&#xa0;smashing half your best crockery and cutting himself in the process.<br />
You <b>hang up</b> hurriedly and <b>attend to</b> baby, crockery, et cetera.<br />
Meanwhile, the meal gets burnt.<br />
As if this were not enough to <b>reduce you to tears</b>,<br />
&#xa0;your husband arrives, unexpectedly bring three guests to dinner.<br />
<br />
Things can go wrong <b>on a big scale</b>,<br />
&#xa0;as a number of people recently discovered in Parramatta, <b>a suburb of Sydney</b>.<br />
During the <b>rush hour</b> one evening two cars collided and both drivers began to argue.<br />
The woman immediately behind the two cars happened to be a learner.<br />
She suddenly <b>got into a panic</b> and stopped her car.<br />
This made the driver following her brake hard.<br />
His wife was sitting beside him holding a large cake.<br />
As she was thrown forward, the cake went right through the windscreen and landed on the road.<br />
Seeing a cake flying through the air,<br />
&#xa0;a lorry driver who was <b>drawing up alongside</b> the car,<br />
&#xa0;<b>pulled up all of a sudden</b>.<br />
The lorry was loaded with empty beer bottles<br />
&#xa0;and hundreds of them <b>slid off</b> the back of the vehicle and on to the road.<br />
This led to yet another angry argument.<br />
Meanwhile, the traffic <b>piled up</b> behind.<br />
It took the police nearly an hour to <b>get the traffic on the move</b> again.<br />
In the meantime, the lorry driver had to <b>sweep up</b> hundreds of broken bottles.<br />
Only two <b>stray dogs benefited from</b> all this confusion,<br />
&#xa0;for they greedily devoured what was left of the cake.<br />
It was just one of those days!<br />
</p>
</div>

<div id="outline-container-org2d866f4" class="outline-3">
<h3 id="org2d866f4">words</h3>
<div class="outline-text-3" id="text-org2d866f4">
<p>
prelude [ˈpreljuːd] n.序幕<br />
unforeseen [ˌʌnfɔːrˈsiːn] adj.意料之外的<br />
series [ˈsɪriːz] n.系列<br />
catastrophe [kəˈtæstrəfi] n.大祸<br />
crockery [ˈkrɑːkəri] n.陶器<br />
suburb [ˈsʌbɜːrb] n.郊区<br />
collide [kəˈlaɪd] v.猛撞<br />
leaner [ˈliːnər] n.初学者<br />
panic [ˈpænɪk] n.惊慌<br />
windscreen [ˈwɪndskriːn] n.挡风玻璃<br />
alongside [əˌlɔːŋˈsaɪd] prep.在&#x2026;的旁边<br />
slide [slaɪd] v.滑<br />
stray [streɪ] adj.迷失的<br />
confusion [kənˈfjuːʒ(ə)n] n.混乱的<br />
greedily [ˈɡriːdɪli] adv.贪婪地<br />
devour [dɪˈvaʊər] v.狼吞虎咽地吃<br />
</p>
</div>
</div>

<div id="outline-container-orgab8b4aa" class="outline-3">
<h3 id="orgab8b4aa">单词造句</h3>
<div class="outline-text-3" id="text-orgab8b4aa">
<p>
prelude n.  a prelude to sth.<br />
</p>
<ol class="org-ol">
<li>My wife claimed that reading fiction was a neccessary prelude to sleep.<br /></li>
<li>Its setting out from the harbour was a prelude to the salvage operation.<br /></li>
<li>The death of a naval officer might be a prelude to a war.<br /></li>
<li>After they pieced together what happened, they suspected this was a prelude to a bigger attack.<br /></li>
<li>I was under the impression<br />
that the arrival of my teacher was a prelude to the end of conversation.<br /></li>
</ol>
<p>
unforeseen adj.  unforeseen + changes/problems/circumstances<br />
</p>
<ol class="org-ol">
<li>Despite unforeseen changes, we have made a profit last year.<br /></li>
<li>Despite unforeseen circumstances in the disater, the salvage operation proved to be successful.<br /></li>
<li>Because of unforeseen problems, he at last failed the exam.<br /></li>
<li>Due to unforeseen changes in the train schedule, he didn't have a perfect alibi any longer.<br /></li>
<li>This manager was apologetic about sending the clothes late because of unforeseen weather.<br /></li>
</ol>
<p>
series n.  a series of<br />
</p>
<ol class="org-ol">
<li>I was conscious that a series of accidents was happening.<br /></li>
<li>There used to be a series of activities in my daily routine.<br /></li>
<li>This manager reprimanded the assistant for making a series of mistakes.<br /></li>
<li>Although it took him three years to elaborate plan, he still made a series of mistakes.<br /></li>
<li>The eccentric who disregards social conventions has made a series of mistakes.<br /></li>
</ol>
<p>
catastrophe n.  be a catastrophe for sb.<br />
</p>
<ol class="org-ol">
<li>Whether this would be a catastrophe for us or not, we should follow our father's instructions.<br /></li>
<li>Failing the exam must have been a catastrophe for his academic future.<br /></li>
<li>He has elaborated a plan which turned out to be a catastrophe for the life in his future.<br /></li>
<li>He invited me to do math homework. This must be a catastrophe for me.<br /></li>
<li>He added a sheet of paper in my collection. This may be a catastrophe for me.<br /></li>
</ol>
<p>
crockery un.<br />
</p>
<ol class="org-ol">
<li>It became an accepted fact that household wives love beautiful crockery.<br /></li>
<li>The crockery was supposed to be smashed in the earthquake.<br /></li>
<li>I stayed overnight to find her keep our crockery in hiding.<br /></li>
<li>I found it impossible to sweep up the broken crockery in two hours.<br /></li>
<li>She has a habit of collecting crockery for years.<br /></li>
</ol>
<p>
suburb n.  in the suburbs/ a suburb of city<br />
</p>
<ol class="org-ol">
<li>He claimed that his son was killed in action in the suburbs.<br /></li>
<li>I love to wander in the suburbs in the moonlight.<br /></li>
<li>We could not afford to the house in a suburb of New York.<br /></li>
<li>He was said to be brought up in a suburb of New York.<br /></li>
<li>Somehow, living in the suburbs is coming into fashion these days.<br /></li>
</ol>
<p>
collide v.  collide with=run into<br />
</p>
<ol class="org-ol">
<li>I felt sorry for the man whose car collided with the back of a truck last week.<br /></li>
<li>She took heart, for she found that her car didn't run into the back of the truck.<br /></li>
<li>For instance, she collided with another student in the process.<br /></li>
<li>They collided with each other so that the teacher reprimanded them for this.<br /></li>
<li>At the moment, the busman did his best not to collide with the car in front of him.<br /></li>
</ol>
<p>
learner n.<br />
</p>
<ol class="org-ol">
<li>You should not regard yourself as a learner and began to drive.<br /></li>
<li>Whether you believe or not, regarding yourslef as a learner is not good for you.<br /></li>
<li>It is important for a learner to judge for himself.<br /></li>
<li>The great director based his film on a learner in London who has just passed the test.<br /></li>
<li>The learner found it hard to drive as well as he thought.<br /></li>
</ol>
<p>
panic n.  get into a panic<br />
</p>
<ol class="org-ol">
<li>My wife got into a panic and pestered me to ask for a better salary.<br /></li>
<li>These horror movies have a universal appeal which make us get into a panic swiftly.<br /></li>
<li>Fearing of being put out of business, he soon got into a panic.<br /></li>
<li>The policeman consoled a person getting into a panic that everything was under control.<br /></li>
<li>My tank wasn't filled with gas. This really made me get into a panic.<br /></li>
</ol>
<p>
windscreen n. windshield<br />
</p>
<ol class="org-ol">
<li>She has the impluse to clean the windscreen.<br /></li>
<li>Though the windscreen reduced the price to $300, we still couldn't afford it.<br /></li>
<li>She found her windscreen broken when she got back home.<br /></li>
<li>My teacher used to order us to clean the windscreen.<br /></li>
<li>He had the windscreen cleaned for free.<br /></li>
</ol>
<p>
alongside prep. adv.  draw up alongside<br />
</p>
<ol class="org-ol">
<li>He drew up alongside me and said: "Fancy meeting you here!"<br /></li>
<li>I knew I might break the world record when I drew up alongside the fastest girl.<br /></li>
<li>The policeman, who was drawing up alongside me, asked me to pull over.<br /></li>
<li>It is disturbing to think that a truck is drawing up alongside you in the highway.<br /></li>
<li>In the light of the chance of meeting her, I drew up alongside her.<br /></li>
</ol>
<p>
slide slid slid v.  slide off/open<br />
</p>
<ol class="org-ol">
<li>As the door slid open, he glanced at a man who was having an operation.<br /></li>
<li>After the curtain went up, the glass slid off my knee and wake up my cat.<br /></li>
<li>No one noticed that a glass slid off my knee in the dim light.<br /></li>
<li>The glass slid off the table onto the floor and was broken.<br /></li>
<li>As the door slid open, I saw my cat which was kidnappered a few days ago.<br /></li>
</ol>
<p>
stray adj.  stray dogs<br />
</p>
<ol class="org-ol">
<li>Because of stray dogs, she changed her mind of raising a cat.<br /></li>
<li>Don't touch these stray dogs with your bare hands.<br /></li>
<li>Technically speaking, they are not stray dogs.<br /></li>
<li>Oddly enought, these stray dogs gained in popularity in those days.<br /></li>
<li>A stray dog rose to fame swiftly because of his eccentricity.<br /></li>
</ol>
<p>
confusion n.  There is some confusion about sth.<br />
</p>
<ol class="org-ol">
<li>There is some confusion about what made your wife get into a panic.<br /></li>
<li>There is some confusion about how to solve this problem.<br /></li>
<li>There is some confusion about when I become fluent in English.<br /></li>
<li>There is some confusion about whether he is a tramp or a beggar.<br /></li>
<li>There is some confusion about who used to smoke in our family.<br /></li>
</ol>
<p>
greedily adv. devour v.<br />
</p>
<ol class="org-ol">
<li>My wife asked me not to greedily devour the pizza in the resturant.<br /></li>
<li>My wife and me quarrled bitterly, for I greedily devoured pizza at the party.<br /></li>
<li>People who live in poverty always greedily devour foods at the party.<br /></li>
<li>I am starving to death and I am gonna devour the meal.<br /></li>
<li>I am genuinely sorry that I greedily devoured the elaborated meal on your birthday.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgae07486" class="outline-3">
<h3 id="orgae07486">反复听电影片段直到懂关键句</h3>
</div>
<div id="outline-container-org4b4fc5f" class="outline-3">
<h3 id="org4b4fc5f">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
<div id="outline-container-org40d92a2" class="outline-3">
<h3 id="org40d92a2">习惯用法造句</h3>
<div class="outline-text-3" id="text-org40d92a2">
<p>
get out of control<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
What invariably happens is that + &#x2026;<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
set up a chain of reactions<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
keep an eye on sb.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
be/speak/talk on the phone<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
hang up (on sb.)<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
attend to sb./sth.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
reduce sb. to tears<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
on a big/large/small scale<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
drawing up alongside<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
rush hour<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
pull up<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
all of a sudden = suddenly<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
pile up<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
get the traffic on the move<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
sweep up<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
benefit from sth.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>

<div id="outline-container-orge95885d" class="outline-3">
<h3 id="orge95885d">跟读 50遍</h3>
</div>
<div id="outline-container-org3a335b8" class="outline-3">
<h3 id="org3a335b8">Comprehension 反复练习</h3>
</div>
<div id="outline-container-org9d6ae09" class="outline-3">
<h3 id="org9d6ae09">Ask me if 写+读</h3>
</div>
<div id="outline-container-org25839c5" class="outline-3">
<h3 id="org25839c5">摘要写作 写 &amp; 对答案</h3>
</div>
<div id="outline-container-orga67a634" class="outline-3">
<h3 id="orga67a634">tell the story 口语复述</h3>
</div>
<div id="outline-container-org3b7126a" class="outline-3">
<h3 id="org3b7126a">composition 阅读 或 写作</h3>
</div>
<div id="outline-container-orgcf94b77" class="outline-3">
<h3 id="orgcf94b77">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
